#todo: Написать программу, которая считывает два числа и выводит их сумму, разность, частное, произведение,
# результат целочисленного деления, результат деления с остатком, результат возведения в степень.
number_1 = int(input("Введите первое число: "))
number_2 = int(input("Введите второе число: "))
print("Сумма", number_1 + number_2)
print("Разность", number_1 - number_2)
print("Частное", number_1 / number_2)
print("Произведение", number_1 * number_2)
print("Целочисленное деление", number_1 // number_2)
print("Деление с остатком", number_1 % number_2)
print("Степент первого числа", number_1**3)
print("Степень второго числа", number_2**3)