#todo: Определить в коде  переменные:

#1. Целочисленного типа:
a = 123
#2. Вещественного типа:
b = 2.2
#3. Логического типа:
c = True
#4. Строкового типа:
d = "Привет мир"
#5. Пустого типа:


#Вывести все их типы.
print(type(a))
print(type(b))
print(type(c))
print(type(d))